using System;
/*
 Дисциплина: "Программирование"

Группа: БПИ202

Студент: Соколова Диана

Дата: 10.09.2020

Задача: Создать решение с именем HW_1 и проектом консольного приложения Task01. В Task01 осуществить вывод на экран строки “Hello, World!”

*/
namespace Task01
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
